EDT/УТ/src/BusinessProcesses/новаМестнаяДоставка/новаМестнаяДоставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>новаМестнаяДоставка</name>
  <task>Task.новаЗадачаМестнойДоставки</task>
  <attributes>
    <name>Груз</name>
    <type>
      <types>DocumentRef.новаГруз</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
      <types>CatalogRef.новаСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
      <types>CatalogRef.новаСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаОтправления</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПрибытия</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОтправленияС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОтправленияПо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытияС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытияПо</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПребыванияГрузоотправителя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПребыванияГрузополучателя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.новаВидыМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаПодтверждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаЗапланирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>VIP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхКатегорий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаВыполненаЧастично</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКатегорияТранспорта</name>
    <type>
      <types>CatalogRef.новаЗначенияКатегорийТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойКонтрагент</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
      <types>CatalogRef.новаСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяТочка</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Инкассация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Факт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаИнкассацииЗаПредыдущиеПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорииТранспортаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>90</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалДоставкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>41</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаИзмененаНаСамовывоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиДоМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиЗаМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБанковскойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКассовогоОбслуживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКАдресуДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БылЗаезд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресИзмененТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженныйАдресДоставки</name>
    <comment>1568 </comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КатегорииТранспорта</name>
    <attributes>
      <name>ЗначениеКатегории</name>
      <type>
        <types>CatalogRef.новаЗначенияКатегорийТранспорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоходыРасходы</name>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.новаСтатьиДоходовРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

EDT/УТ/src/BusinessProcesses/новаМестнаяДоставка/Forms/ФормаБизнесПроцессаУпр/Module.bsl
&НаКлиенте
Процедура ОткрытьРеализацию(Команда)
	СсылкаРеал = ПолучитьСсылкуНаРеализациюНаСервере();
	Если СсылкаРеал <> Неопределено Тогда
		ПоказатьЗначение(,СсылкаРеал);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПолучитьСсылкуНаРеализациюНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Номер = &Номер";

	Запрос.УстановитьПараметр("Номер", Объект.Номер);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ВремяОтправленияСМинутыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Элементы.ВремяОтправленияСМинуты.СписокВыбора.Очистить();
	
	НачальнаяДата = НачалоДня(ТекущаяДата());
	
	СписокВремени = Новый СписокЗначений;
	
	Для х=0 По 47 Цикл
		
		нДата = НачальнаяДата + х*60*30;
	                     
		Элементы.ВремяОтправленияСМинуты.СписокВыбора.Добавить(нДата); 	
	
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеСписковДат(СтрНазванияЭлемента,НачальнаяДатаЭл)
	Элементы[СтрНазванияЭлемента].СписокВыбора.Очистить();
	НачальнаяДата = НачалоДня(НачальнаяДатаЭл);
	Для х=0 По 47 Цикл
		нДата = НачальнаяДата + х*60*30;
		Элементы[СтрНазванияЭлемента].СписокВыбора.Добавить(нДата); 	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнениеСписковДат("ВремяОтправленияС",Объект.ВремяОтправленияС);
	ЗаполнениеСписковДат("ВремяОтправленияПо",Объект.ВремяОтправленияПо);
	ЗаполнениеСписковДат("ВремяПрибытияС",Объект.ВремяПрибытияС);
	ЗаполнениеСписковДат("ВремяПрибытияПо",Объект.ВремяПрибытияПо);
	
	ИсторияСписок.Отбор.Элементы.Очистить();
	ЭлементОтбораСчета = ИсторияСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбораСчета.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БизнесПроцесс"); 
	ЭлементОтбораСчета.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбораСчета.Использование = Истина; 
	ЭлементОтбораСчета.ПравоеЗначение = Объект.Ссылка;

КонецПроцедуры

&НаКлиенте
Процедура ВремяОтправленияСПриИзменении(Элемент)
	ЗаполнениеСписковДат("ВремяОтправленияС",Объект.ВремяОтправленияС);
КонецПроцедуры

&НаКлиенте
Процедура ВремяОтправленияПоПриИзменении(Элемент)
	ЗаполнениеСписковДат("ВремяОтправленияПо",Объект.ВремяОтправленияПо);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПрибытияСПриИзменении(Элемент)
	ЗаполнениеСписковДат("ВремяПрибытияС",Объект.ВремяПрибытияС);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПрибытияПоПриИзменении(Элемент)
	ЗаполнениеСписковДат("ВремяПрибытияПо",Объект.ВремяПрибытияПо);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаПрибытияПриИзменении(Элемент)
	may.ИзминениеРасстояниеПоДорогамДляДоставки(Объект.Номер, Объект.ТочкаОтправления,Объект.ТочкаПрибытия);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаОтправленияПриИзменении(Элемент)
	may.ИзминениеРасстояниеПоДорогамДляДоставки(Объект.Номер, Объект.ТочкаОтправления,Объект.ТочкаПрибытия);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьУпр(Команда)
	ЭтаФорма.Записать();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьУпр(Команда)
	ЭтаФорма.Записать();
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляТочкиПрибытия()
		
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	            |	Выбор Когда РеализацияТоваровУслуг.ТерминалДоставки.Код = 1 Тогда Истина Иначе Ложь Конец КАК НадоПроизводитьПоискПолигона
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |ГДЕ
	            |	РеализацияТоваровУслуг.Номер = &Номер";
	Зап.УстановитьПараметр("Номер", Объект.Номер);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Структура = Новый Структура;
	Структура.Вставить("Заказ",Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	Структура.Вставить("НадоПроизводитьПоискПолигона",Истина);
	
	Пока Выб.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Заказ",Выб.Заказ);
		Структура.Вставить("НадоПроизводитьПоискПолигона",Истина);
	КонецЦикла;
	
	Возврат Структура;

КонецФункции

&НаКлиенте
Процедура ТочкаПрибытияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрукЗаказа = ПолучитьДанныеДляТочкиПрибытия();
	Парам = Новый Структура;
	Парам.Вставить("Ключ", Объект.ТочкаПрибытия);
	Форма = ПолучитьФорму("Справочник.новаТочкиДоставки.Форма.ФормаЭлементаУпр", Парам);
	Форма.Заказ = СтрукЗаказа.Заказ;
	Форма.НадоПроизводитьПоискПолигона = СтрукЗаказа.НадоПроизводитьПоискПолигона;
	Форма.Открыть();


КонецПроцедуры
